Revit 2024 API
MEPNetworkSegmentData.FrictionFactor Property
 The calculated friction factor of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double FrictionFactor { get; }
Visual Basic
Public ReadOnly Property FrictionFactor As Double
	Get
Visual C++
public:
property double FrictionFactor {
	double get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace